app/views/static_pages/home.html.erb


                  <% @attendingmeal =  Attending.find_by_user_id_and_lunch_id(current_user.id, pubmeal.id) %>
---
SELECT "attendings".* FROM "attendings" WHERE "attendings"."user_id" = 1 AND "attendings"."lunch_id" = 1 LIMIT 1

                        <!--
                      <% @creator = User.find(pubmeal.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]