app/controllers/meals_controller.rb

	def create

=begin
		mealtitle = params[:meal][:title]
		mealdesc = params[:meal][:description]
		mealtime = params[:meal][:mealtime]
		mealloc = params[:meal][:location]
		mealpub = params[:meal][:public]


		@meal = Meal.new( :title => mealtitle, :description => mealdesc,
			:mealtime => mealtime, :location => mealloc, :public => mealpub, :user_id => current_user.id )
		@meal.save
---
INSERT INTO "meals" ("created_at", "description", "meal_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 04 Apr 2013 07:06:49 UTC +00:00], ["description", "sd"], ["meal_date", nil], ["title", "asdf"], ["updated_at", Thu, 04 Apr 2013 07:06:49 UTC +00:00]]

	def attendmeal
		@mealid = params[:id]

		@attending = Attending.new(:user_id => current_user.id, :lunch_id => @mealid)
		@attending.save
---
INSERT INTO "attendings" ("created_at", "lunch_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 05 Apr 2013 02:48:42 UTC +00:00], ["lunch_id", 1], ["updated_at", Fri, 05 Apr 2013 02:48:42 UTC +00:00], ["user_id", 2]]

	def cancel
		@mealid = params[:id]

		@attending = Attending.where(:user_id => current_user.id, :lunch_id => @mealid).first.destroy
---
DELETE FROM "attendings" WHERE "attendings"."id" = ?  [["id", 1]]
SELECT "attendings".* FROM "attendings" WHERE "attendings"."user_id" = 1 AND "attendings"."lunch_id" = 1 LIMIT 1

	def show
		@meal = Meal.find(params[:id])

		require 'open-uri'
		require 'json'

		@location = @meal.location.sub ' ', '+'
		@city = @meal.city
		@state = @meal.state

		@result = JSON.parse(open("https://maps.googleapis.com/maps/api/place/textsearch/json?query=+#{@location}+#{@city}+#{@state}+&sensor=true&key=AIzaSyDaZ6y5ImLfUW9Ne_HvnrU0T5E16Lkyv4w").read)

		@pricelevel = @result["results"].first["price_level"]
		@rating = @result["results"].first["rating"]

		@address = @result["results"].first["formatted_address"]


		@lat = @result["results"].first["geometry"]["location"]["lat"]
		@lng = @result["results"].first["geometry"]["location"]["lng"]


		@people = []

		@attendees = Attending.where(:lunch_id => @meal.id)
		@attendees.each do |a|
			@user = User.find(a.user_id)
---
SELECT "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "attendings".* FROM "attendings" WHERE "attendings"."lunch_id" = 1
SELECT "attendings".* FROM "attendings" WHERE "attendings"."meal_id" = 2
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]