app/controllers/static_pages_controller.rb

	def home
		@pubmeals = Meal.where(:public => true)
---
SELECT "meals".* FROM "meals" WHERE "meals"."public" = 't'